app/controllers/school_classes_controller.rb

  def create
    new_school_class = SchoolClass.create(school_class_params(:title, :room_number))
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Bio"], ["room_number", 321], ["created_at", "2021-01-15 20:56:18.589789"], ["updated_at", "2021-01-15 20:56:18.589789"]]

  def update
    @school_class.update(school_class_params(:title,:room_number))
---
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 321], ["updated_at", "2021-01-15 21:27:20.205228"], ["id", 13]]